text/07-an-imperative-language.org
#+title: Chapter 7 : An Imperative Language
* <<intro>>

This chapter aims to give more fluency in the use of block structure and mutual recursion, and more confidence in writing larger programs than those in Part One of this book.  The program described here is a compiler interpreter for a very small imperative language.  None of the concepts of the language are new, so the language is first described by a user manual.

* User manual

The language TYPROC is a very small imperative language.  It has assignment statements, I-O statements and structured flow of control statements including recursive calls of previously declared procedures.  Variables are global, and they have to be declared as being of either type Boolean or type integer.  Expressions are built from variables and literal constants by means of a small number of inbuilt operators.  Strict type checking is maintained throughout.  The language is not intended for serious use but as an illustration in language implementation and documentation.

The language is described by the following BNF productions for the context free syntax, and by the accompanying text for the context sensitive syntax and for the semantics.

#+begin_example
input-file ::=
    [ programme ] '.'
#+end_example

The processor reads an input file consisting of zero or more programs which are processed as soon as they have been read, terminated by a period.

#+begin_example
programme  ::=
    'BOOLEAN' [ ( 'a' | 'b' .. 'z' ) ]
    'INTEGER' [ ( 'a' | 'b' .. 'z' ) ]
    [ ( 'A' | 'B' .. 'Z' ) body ]
    body '.'
#+end_example

A program consists of declarations of variables and procedures and a body.  Variables are just lower case letters, and they are typed as Boolean or integer.  Procedures are upper case letters, and their declaration is followed by a body.  Variables and procedures have to be declared before they can be used in a body, and they cannot be redeclared.  When a programme has been read, execution begins with its body.

#+begin_example
body  ::=
    'BEGIN' statement-sequence 'END'
statement-sequence  ::=
    statement [ ';' statement ]
#+end_example

A body is a statement sequence enclosed in =BEGIN= and =END=.  A statement sequence consisting of one or more statements separated by semicolons is executed by executing the statements one after another.

#+begin_example
statement  ::=
    ( 'a' | 'b' .. 'z' ) '=' expression |
    'A' | 'B' .. 'Z' |
    'BEGIN' statement-sequence 'END' |
    'IF' expression 'THEN' statement |
    'WHILE' expression 'DO' statement |
    'READ' ( 'a' | 'b' .. 'z' ) |
    'WRITE' expression |
    'LINE' |
    'TAB'
#+end_example

There are several kinds of statements.  Assignment statements are of the form =v = e=, where =v= is a variable that has been declared and =e= is an expression of the same type.  Execution has the effect of evaluating =e= and assigning its value to =v=.  Procedure calls are of the form =P=, where =P= is a procedure that has been declared; execution has the effect of executing the body of =P=.  Compound statements provide a means of executing a sequence of statements in =IF= and =WHILE= statements.  In =IF= and =WHILE= statements the expression must be of type Boolean.  In an =IF= statement the =THEN= part is executed only if the expression evaluates to true.  In a =WHILE= statement the =DO= part is executed zero or more times, as long as the expression evaluates to true.  In =READ= statements the variable has to have been declared, execution has the effect of reading from the input file either an integer or a Boolean value and assigning this to the variable.  =WRITE= statements will evaluate the expression, which may be of either type, and write its value to the output file.  =LINE= statements start a new line, =TAB= statements write a tab.

#+begin_example
expression  ::=
    simple-expression { ('>' | '<' | '=' ) simple-expression }
#+end_example

An expression is either a simple expression or two simple expressions separated by a comparison operator.  In the second case the type of the expression will be Boolean, and the expression will be evaluated to true if the comparison holds between the values of the two simple expressions.

#+begin_example
simple-expression  ::=
    term [ ( '+' | '-' | '#' ) term ]
#+end_example

A simple expression consists of one or more terms separated by addition, subtraction or disjunction operators.  The term on the left and the term on the right have to be of the same type.  For the two arithmetic operators the types have to be integer, for the disjunction operator the types have to be Boolean.  The result type of the simple expression is that of its terms.  During evaluation the terms are evaluated left to right and the operation is applied to their values.

#+begin_example
term  ::=
    factor [ ( '*' | '/' | '&' ) factor ]
#+end_example

A term consists of one or more factors separated by multiplication, division or conjunction operators.  The factors have to be of the same type, integer for the arithmetic operators and Boolean for conjunction, and the result type is the same as that of the factors.  Evaluation is left to right.

#+begin_example
factor  ::=
    'a' | 'b' .. 'z' |
    ( '0' | '1' .. '9' ) [ ( '0' | '1' .. '9' ) ] |
    '(' expression ')' |
    '-' factor |
    'TRUE' |
    'FALSE |
    'ORD' factor
#+end_example

A factor can be a variable that has been previously declared, the result type of the factor is that of the variable.  A factor can also be a string of decimal digits interpreted as an integer (up to an implementation dependent number of bits, typically 32), and the result type is integer.  A factor can be a parenthesised expression of either type, and that will be the result type.  A factor can be a negated factor of type Boolean, and its result type is Boolean, note that =-= is /overloaded/: as an infix operator it means subtraction, as a prefix operator it means negation.  A factor can also be one of the two Boolean constants, giving result type Boolean.  Finally, a factor can be the =ORD= function applied to a factor of any type, the result type is integer; if the contained factor is of type integer, then =ORD= is the identity function, and if the contained factor is of type Boolean, then =ORD= evaluates to 0 for false and to 1 for true.

Comments are written just inside curly braces like this: ={ this is a comment }=.  The grammar as given does not explain this, and indeed most documentations for languages leave such a detail to the informal explanations.  Comments are generally treated like white space.

