07-an-imperative-language.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 7 : An Imperative Language</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 7 : An Imperative Language"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:38:07 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 7 : An Imperative Language</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 User manual</a></li>
<li><a href="#sec-3">3 Designing the implementation</a>
<ul>
<li><a href="#sec-3-1">3.1 Implementing the syntax</a></li>
<li><a href="#sec-3-2">3.2 Step 1: <i>Visibility requirements</i>:</a></li>
<li><a href="#sec-3-3">3.3 Step 2: <i>Bodies of parsing procedures</i>:</a></li>
<li><a href="#sec-3-4">3.4 Step 3: <i>Declarations</i>:</a></li>
<li><a href="#sec-3-5">3.5 Step 4: <i>Type checking</i>:</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 Implementing the semantics</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 Step 5: <i>Designing the internal code</i>:</a></li>
<li><a href="#sec-3-7">3.7 Step 6: <i>Translating into internal code</i>:</a></li>
<li><a href="#sec-3-8">3.8 Step 7: <i>Interpreting the internal code</i>:</a></li>
</ul>
</li>
<li><a href="#sec-4">4 The program</a></li>
<li><a href="#sec-5">5 Exercises and reading</a>
<ul>
<li><a href="#sec-5-1">5.1 <i>Changing the implementation</i>:</a></li>
<li><a href="#sec-5-2">5.2 <i>Changing the language</i>:</a></li>
<li><a href="#sec-5-3">5.3 <i>Reading</i>:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
This chapter aims to give more fluency in the use of block structure and mutual recursion, and more confidence in writing larger programs than those in Part One of this book.  The program described here is a compiler interpreter for a very small imperative language.  None of the concepts of the language are new, so the language is first described by a user manual.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User manual</h2>
<div class="outline-text-2" id="text-2">


<p>
The language TYPROC is a very small imperative language.  It has assignment statements, I-O statements and structured flow of control statements including recursive calls of previously declared procedures.  Variables are global, and they have to be declared as being of either type Boolean or type integer.  Expressions are built from variables and literal constants by means of a small number of inbuilt operators.  Strict type checking is maintained throughout.  The language is not intended for serious use but as an illustration in language implementation and documentation.
</p>
<p>
The language is described by the following BNF productions for the context free syntax, and by the accompanying text for the context sensitive syntax and for the semantics.
</p>



<pre class="example">input-file ::=
    [ programme ] '.'
</pre>


<p>
The processor reads an input file consisting of zero or more programs which are processed as soon as they have been read, terminated by a period.
</p>



<pre class="example">programme  ::=
    'BOOLEAN' [ ( 'a' | 'b' .. 'z' ) ]
    'INTEGER' [ ( 'a' | 'b' .. 'z' ) ]
    [ ( 'A' | 'B' .. 'Z' ) body ]
    body '.'
</pre>


<p>
A program consists of declarations of variables and procedures and a body.  Variables are just lower case letters, and they are typed as Boolean or integer.  Procedures are upper case letters, and their declaration is followed by a body.  Variables and procedures have to be declared before they can be used in a body, and they cannot be redeclared.  When a programme has been read, execution begins with its body.
</p>



<pre class="example">body  ::=
    'BEGIN' statement-sequence 'END'
statement-sequence  ::=
    statement [ ';' statement ]
</pre>


<p>
A body is a statement sequence enclosed in <code>BEGIN</code> and <code>END</code>.  A statement sequence consisting of one or more statements separated by semicolons is executed by executing the statements one after another.
</p>



<pre class="example">statement  ::=
    ( 'a' | 'b' .. 'z' ) '=' expression |
    'A' | 'B' .. 'Z' |
    'BEGIN' statement-sequence 'END' |
    'IF' expression 'THEN' statement |
    'WHILE' expression 'DO' statement |
    'READ' ( 'a' | 'b' .. 'z' ) |
    'WRITE' expression |
    'LINE' |
    'TAB'
</pre>


<p>
There are several kinds of statements.  Assignment statements are of the form <code>v = e</code>, where <code>v</code> is a variable that has been declared and <code>e</code> is an expression of the same type.  Execution has the effect of evaluating <code>e</code> and assigning its value to <code>v</code>.  Procedure calls are of the form <code>P</code>, where <code>P</code> is a procedure that has been declared; execution has the effect of executing the body of <code>P</code>.  Compound statements provide a means of executing a sequence of statements in <code>IF</code> and <code>WHILE</code> statements.  In <code>IF</code> and <code>WHILE</code> statements the expression must be of type Boolean.  In an <code>IF</code> statement the <code>THEN</code> part is executed only if the expression evaluates to true.  In a <code>WHILE</code> statement the <code>DO</code> part is executed zero or more times, as long as the expression evaluates to true.  In <code>READ</code> statements the variable has to have been declared, execution has the effect of reading from the input file either an integer or a Boolean value and assigning this to the variable.  <code>WRITE</code> statements will evaluate the expression, which may be of either type, and write its value to the output file.  <code>LINE</code> statements start a new line, <code>TAB</code> statements write a tab.
</p>



<pre class="example">expression  ::=
    simple-expression { ('&gt;' | '&lt;' | '=' ) simple-expression }
</pre>


<p>
An expression is either a simple expression or two simple expressions separated by a comparison operator.  In the second case the type of the expression will be Boolean, and the expression will be evaluated to true if the comparison holds between the values of the two simple expressions.
</p>



<pre class="example">simple-expression  ::=
    term [ ( '+' | '-' | '#' ) term ]
</pre>


<p>
A simple expression consists of one or more terms separated by addition, subtraction or disjunction operators.  The term on the left and the term on the right have to be of the same type.  For the two arithmetic operators the types have to be integer, for the disjunction operator the types have to be Boolean.  The result type of the simple expression is that of its terms.  During evaluation the terms are evaluated left to right and the operation is applied to their values.
</p>



<pre class="example">term  ::=
    factor [ ( '*' | '/' | '&amp;' ) factor ]
</pre>


<p>
A term consists of one or more factors separated by multiplication, division or conjunction operators.  The factors have to be of the same type, integer for the arithmetic operators and Boolean for conjunction, and the result type is the same as that of the factors.  Evaluation is left to right.
</p>



<pre class="example">factor  ::=
    'a' | 'b' .. 'z' |
    ( '0' | '1' .. '9' ) [ ( '0' | '1' .. '9' ) ] |
    '(' expression ')' |
    '-' factor |
    'TRUE' |
    'FALSE |
    'ORD' factor
</pre>


<p>
A factor can be a variable that has been previously declared, the result type of the factor is that of the variable.  A factor can also be a string of decimal digits interpreted as an integer (up to an implementation dependent number of bits, typically 32), and the result type is integer.  A factor can be a parenthesised expression of either type, and that will be the result type.  A factor can be a negated factor of type Boolean, and its result type is Boolean, note that <code>-</code> is <i>overloaded</i>: as an infix operator it means subtraction, as a prefix operator it means negation.  A factor can also be one of the two Boolean constants, giving result type Boolean.  Finally, a factor can be the <code>ORD</code> function applied to a factor of any type, the result type is integer; if the contained factor is of type integer, then <code>ORD</code> is the identity function, and if the contained factor is of type Boolean, then <code>ORD</code> evaluates to 0 for false and to 1 for true.
</p>
<p>
Comments are written just inside curly braces like this: <code>{ this is a comment }</code>.  The grammar as given does not explain this, and indeed most documentations for languages leave such a detail to the informal explanations.  Comments are generally treated like white space.
</p>
</div>

</div>
