text/07-an-imperative-language.org
* Designing the implementation

For the implementation of this language we shall distinguish syntax and semantics rather thoroughly.

** Implementing the syntax

In all our previous programs the basic symbols were single printing characters.  In this language symbols consist of either single letters for user declared variables and procedures, or inbuilt single letter special characters, or inbuilt multi capital letter words.  The procedure for reading symbols, called =getsym=, has to be able to detect these multi character symbols.  After skipping any non-printing characters, it has to examine the current character: If it is a capital and the next character waiting in the input is also a capital, then the two capitals and any following capitals are collected in a short string.  If the current character is an opening brace for a comment, characters are skipped up to the closing brace and the procedure starts again.  In all other cases the procedure does not read beyond the current single character.  The language was designed to make this simple technique possible.  The procedure =getsym= is an unusually simple scanner for a language with multi-character symbols.  Indeed, it does not have to know much about the language to be parsed.  Other scanners that we shall see in later chapters are much more complex, and some even make use of auxiliary tables.  But often this will have the advantage that the parser does not need to know much about how symbols are written.  The simple scanner given here has to delegate most of the recognition of symbols to the parser.  Consequently, much surface detail has to be spread throughout the program.  For example, the maximum length of the string for multi-character symbols is spread all over the parser.  Hence there cannot be a constant declaration to set the maximum length (to 8 or whatever).

For the parsing procedures we now distinguish various steps in the design.  If you are writing the program yourself, you are advised to maintain a discipline of steps similar to the ones used here.  The steps continue in the next section on semantics.

** Step 1: /Visibility requirements/:
A detailed examination of the grammar shows that the productions are already ordered in a convenient way: each non-terminal needs access either to one defined earlier, or to itself, or to the one immediately following.  Hence all visibility requirements will be satisfied if all the parsing procedures are nested successively as in the grammar, =programme= outermost, =factor= innermost.

** Step 2: /Bodies of parsing procedures/:
Most of this should be routine by now, except that a CASE statement can no longer be used for the non-terminals which have alternatives.  Because some symbols are single characters and some are short strings, a cascade of =IF-THEN-ELSE-IF-..= has to be used in the parsing procedures for factor and for statement.  Wrong symbols produce a call to the by now familiar error handler.

** Step 3: /Declarations/:
Inside =programme=, whenever a variable is declared, then this fact should be noted, and the type also needs recording.  In this simple language we can manage by entering declared variables into an appropriate set --- one for the integers, and one for the Booleans.  Whenever a procedure is declared, it is entered into a set of procedures.  Then inside =statement=, for the variable in an assignment statement it has to be checked that it is in one of the two sets of declared variables.  Also inside =statement=, calls of procedures have to be checked.  Finally, inside =factor= any variables have to be checked.

** Step 4: /Type checking/:
Inside =factor= all variables, the numeric constants and the Boolean constants have one of two types, and these types have to be transmitted to the procedure which called =factor=.  Also inside =factor=, a check has to be made that the negand was of type Boolean, and the result will be of type Boolean.  For =ORD= no type check is made, but the result will be integer.  For terms, simple expressions and expressions containing infix operators a check has to be made that the operands are appropriate for the infix operator.  For terms and simple expressions the result type is the same as that of the operands, for expressions the result type Boolean is returned.  The appropriate implementation mechanism is similar to the one for returning values in the infix evaluator of Chapter 3: each of the above procedures needs a =VAR= parameter whose possible values are of two types, and each of the procedures for infix operators need a similar local variable for the second operand.  A local variable is also needed inside =statement= for calls of =expression=.  This occurs inside assignment statements for which type agreement of the variable and the expression has to be checked.  It also occurs in =IF= and =WHILE= statements for which the expression must be Boolean.  In =WRITE= statements no type check is needed for the expression, but the type of the expression will determine what code is to be generated later.

*** Implementing the semantics

Up to this point we have been concerned with syntax only.  Some earlier authors would have called steps 3 and 4 /static semantics/, but this was based on the misconception that syntax has to be context free.  Semantics assigns meanings to the symbols of the language and to the more complex constructions.  A simple example is that =&= means AND.  Assignment of meaning was done directly in the infix evaluator of Chapter 3, but here it has to be done indirectly.  Loops may result in their bodies being executed several times, so for the same reason as for the truth table generator of Chapter 5, the code has to be stored internally.  So the semantics requires an indirect assignment of meaning to the language seen by the user, by first specifying a translation scheme and then assigning meaning to translations.  For example, =&= is translated internally to =conj= which means AND.

