07-an-imperative-language.html

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Step 5: <i>Designing the internal code</i>:</h3>
<div class="outline-text-3" id="text-3-6">

<p>Whereas postfix code as in the truth table generator is good for evaluating expressions, something else is needed for the execution of loops or of conditionals.  Essentially we should like to say something like this:
</p>



<pre class="example">A term can be 'F1 &amp; F2',
        where F1 and F2 are factors,
    and its translation is: and-op(G1,G2)
        where G1 and G2 are the translations of F1 and F2,
    whose value is: V1 AND V2,
        where V1 and V2 are the values of G1 and G2.
A statement can be 'WHILE E DO S'
        where E is an expression, and
        where S is a statement,
    and its translation is: while-op(F,T),
        where F and T are the translations of E and S,
    which is executed:
        WHILE the value of F (is true) DO execute T.
</pre>


<p>
Note that <code>F1 &amp; F2</code> and <code>WHILE E DO S</code>, as they occur in the first lines, belong to the object language whose meaning is being explained; we are not expected to know the meaning of either.  Of course we and the Pascal compiler are supposed to know what <code>AND</code>, <code>WHILE</code> and <code>DO</code> mean where they occur unquoted near the end.
</p>
<p>
We now have to think of a way of representing such translations.  A uniform way of doing this is to think of <code>conj</code> and <code>while</code> as operators with two arguments which are pointers to other, possibly complex things.  Those other things can also consist of operators with two pointers, but ultimately there must be operands which do not point to anything.  Pointers indicate an address where something is to be found, we can use integer pointers into an <code>ARRAY</code> of three-part =RECORD=s with an operator and two integers.  The integers are also used to hold addresses of variables or the code of procedures, and to represent numeric and Boolean constants.
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Step 6: <i>Translating into internal code</i>:</h3>
<div class="outline-text-3" id="text-3-7">

<p>Once the internal code has been designed, it is an easy matter to produce the translations during the parsing.  The translation is very similar to translation into postfix in the truth table generator.  Each translation step is handled by a call to a code generating procedure, which is similar to the one in the truth table generator.  But instead of one parameter, it has three: an operator and two integers, and it deposits the values of the three in another <code>RECORD</code>.  The two integers have to be known at the time the call is made.  For variables and constants in <code>factor</code> this is no problem, for the arithmetic and Boolean operators it has to be done when the address of the code for the operands is known, after the second operand has been processed.  So the order of generation is the same as that for postfix code.  The address of the code for the second operand will be the most recently generated code, so that is easily accessible.  But the address of the code for the first operand will be lost by now; so that has to be saved in a local variable when the infix operator is seen.  Since the procedures for infix operators can each process several, in fact three, different operators each, the source operators also have to be saved in another local variable so that the correct internal code can be generated.  The mechanism is already familiar from the truth table generator in procedure formula.  Essentially the same mechanism is used in the parsing procedure for statements and for statement sequences; for the latter it should be noted that semicolons produce code in the same way that <code>+</code> does.  Inside <code>programme</code> no code is generated for declarations, but for a procedure the last code generated by its body has to be attached to the name of the procedure, so that a call to this code can be generated when the procedure is called inside <code>statement</code>.
</p>
</div>

</div>
