text/07-an-imperative-language.org
** Step 7: /Interpreting the internal code/:
The code for the body of the (main) programme will be the last code that has been generated.  This can now be interpreted by either real hardware or by a software interpreter.  Both would need space for the variables of the program; the way it has been designed here all 26 potential variables need to be given space.  For a hardware interpreter the internal code would have to be loaded into another space, but for our software interpreter it is already there.  So when the entire programme has been read, checked for errors and translated, the main program should pass it onto an interpreter which has an =ARRAY= of 26 integers for the potential variables.  Then the body of the programme has to be executed.  During execution expressions will have to be evaluated, both Boolean and integer.  So a natural way to think of the entire interpretation is that it involves recursive calls of a procedure for executing statements and two functions for evaluating expressions.  The procedure and the functions each take an integer parameter which is the index of a =RECORD= in the code =ARRAY=, and each makes a =CASE= decision based on the operator part of the =RECORD=.  The cases resemble those in the infix evaluator and the truth table generator, and when there are recursive calls then one or both of the integer parts of the =RECORD= are used as parameters of the call.

If a program is preceded by =?=, then the code for every body will be displayed when the body has been read.  If a program is not terminated by =.= but by =?=, then the execution will be traced.  These two facilities were not mentioned in the user manual, they are supposedly secret information, known only to the implementor who is checking the internal workings.

The following is a sample run from TYPROC:

#+begin_example
ready
{ demonstrating generated code and tracing of execution }
{ request to display the code after translation: } ?
INTEGER i
BEGIN
i = 1010101;
WRITE 42 * i
END
                code for this body :
               1             IMMED   1010101         0
               2           IASSIGN         8         1
               3             IMMED        42         0
               4             FETCH         8         0
               5               MUL         3         4
               6            IWRITE         0         5
               7           SEMICOL         2         6

{ request to trace execution: } ?
                interpreting ...
               7           SEMICOL         2         6
               2           IASSIGN         8         1
               1             IMMED   1010101         0
               6            IWRITE         0         5
               5               MUL         3         4
               3             IMMED        42         0
               4             FETCH         8         0
  42424242
  variable     value
         i   1010101
ready

{ request to display the code after translation: } ?
BOOLEAN p q
BEGIN
p = TRUE;
q = FALSE;
WRITE  (p & - FALSE # - q)  &  p ;
LINE
END
                code for this body :
               1             IMMED         1         0
               2           BASSIGN        15         1
               3             IMMED         0         0
               4           BASSIGN        16         3
               5           SEMICOL         2         4
               6             FETCH        15         0
               7             IMMED         0         0
               8             NOTOP         0         7
               9             ANDOP         6         8
              10             FETCH        16         0
              11             NOTOP         0        10
              12              OROP         9        11
              13             FETCH        15         0
              14             ANDOP        12        13
              15            BWRITE         0        14
              16           SEMICOL         5        15
              17            LINEOP         0         0
              18           SEMICOL        16        17
 .
  TRUE
ready

{ demonstration of procedures }

INTEGER
  i { counter }
  s { square }
  c { cube }
  f { fourth power }
  t { total of squares }
  u { total of cubes }
  w { total of fourth powers }

I                               { initialisation }
  BEGIN
  i = 1;  t = 0;  u = 0;  w = 0
  END

C                               { computing and writing }
  BEGIN
  WHILE i < 6 DO
    BEGIN
    s = i * i;  c = s * i;  f = s * s;
    WRITE i;  WRITE s;  WRITE c;  WRITE f;  LINE;
    t = t + s;  u = u + c;  w = w + f;
    i = i + 1
    END
  END

R                               { writing totals }
  BEGIN
  LINE;  TAB;  WRITE t;  WRITE u;  WRITE w;  LINE
  END

BEGIN                           { main program }
I;
C;
R
END .
         1         1         1         1
         2         4         8        16
         3         9        27        81
         4        16        64       256
         5        25       125       625

                  55       225       979
ready

.
#+end_example

