07-an-imperative-language.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The program</h2>
<div class="outline-text-2" id="text-4">


<p>
The following is the standard Pascal source program for the imperative language TYPROC.
</p>



<pre class="example">PROGRAM typroc(input,output);
(* TYpes, PROCedures, treecode, recursive interpreter *)

LABEL 1,99;

CONST
    echo = true; (* echo = usage_is_not_interactive *)
    tt = 16;
    maxcode = 200;

TYPE
    types = (booltyp,inttyp);
    operator =
        (fetch,immed,call,notop,andop,orop,less,great,equal,
        add,sub,mul,divid,bassign,iassign,semicol,ifop,whilop,
        bread,iread,bwrite,iwrite,lineop,tabop);
    instruction =
        RECORD op : operator; left,right : integer END;
    alfa     = PACKED ARRAY [1..8] OF char;
    string20 = PACKED ARRAY [1..20] OF char;

VAR
    ch : char;          (* from getsym *)
    al : alfa;
    boolvars,intvars : SET OF 'a'..'z';
    procedures : SET OF 'A'..'Z';
    procaddresses : ARRAY ['A'..'Z'] OF integer;
    code : ARRAY [1..maxcode] OF instruction;
    lastcode : integer; (* code index *)
    tracing : boolean;
    i : integer;

(* - - - - -   C O M P I L E R   - - - - - *)

PROCEDURE getsym;
LABEL 1;
VAR I : integer;

    PROCEDURE getch;
    BEGIN (* getch *)
    IF eof THEN
        BEGIN
        writeln('unexepcted end of file');
        GOTO 99
        END;
    WHILE eoln DO
        BEGIN readln; IF echo THEN writeln END;
    read(ch); IF echo THEN write(ch)
    END; (* getch *)

BEGIN (* getsym *)
1:
al := '        ';
REPEAT getch UNTIL ch &gt; ' ';
IF (ch IN ['A'..'Z']) AND (input^ IN ['A'..'Z']) THEN
    BEGIN
    al[1] := ch; i := 2;
    REPEAT
        getch; IF i &lt; 8 THEN al[i] := ch; i := i + 1
        UNTIL NOT (input^ IN ['A'..'Z']);
    ch := ' '
    END (* IF *)
ELSE IF ch = '{' THEN
    BEGIN (* comment *)
    REPEAT getch UNTIL ch = '}';
    GOTO 1
    END
END; (* getsym *)

PROCEDURE gen(o : operator; l,r : integer);
BEGIN (* gen *)
lastcode := lastcode + 1;
WITH code[lastcode] DO
    BEGIN op := o; left := l; right := r END
END; (* gen *)

PROCEDURE showcode(i : integer);
BEGIN (* showcode *)
WITH code[i] DO
    writeln(i:tt,'        ',op:10,left:10,right:10)
END; (* showcode *)

PROCEDURE programme;
VAR c : char;

  PROCEDURE error(message : string20);
  BEGIN (* error *)
  write('error : ');
  IF message[1] &lt;&gt; ' ' THEN
      BEGIN
      IF ch &lt;&gt; ' ' THEN write('"',ch,'"') ELSE write('"',al,'"');
      write(' when ')
      END;
  writeln(message); readln; GOTO 1
  END; (* error *)

  PROCEDURE body;
  VAR firstcode : integer;

    PROCEDURE statementsequence;
    VAR left : integer;

      PROCEDURE statement;
      VAR typ : types; c : char; left : integer;

        PROCEDURE expression(VAR typ : types);
        VAR typ2 : types; c : char; left : integer;

          PROCEDURE simpexpression(VAR typ : types);
          VAR typ2 : types; c : char; left : integer;

            PROCEDURE term(VAR typ : types);
            VAR typ2 : types; c : char; left : integer;

              PROCEDURE factor(VAR typ : types);
              VAR num : integer;
              BEGIN (* factor *)
              IF ch IN ['a'..'z'] THEN
                  BEGIN
                  IF NOT (ch IN boolvars + intvars)
                      THEN error('undeclared variable ');
                  IF ch IN boolvars
                      THEN typ := booltyp
                      ELSE typ := inttyp;
                  gen(fetch,ord(ch) - ord('a'),0);
                  getsym
                  END
              ELSE IF ch IN ['0'..'9'] THEN
                  BEGIN
                  num := 0;
                  REPEAT
                      num := 10 * num + ord(ch) - ord('0');
                      getsym;
                      UNTIL NOT (ch IN ['0'..'9']);
                  typ := inttyp;
                  gen(immed,num,0)
                  END
              ELSE IF ch = '(' THEN
                  BEGIN
                  getsym;
                  expression(typ);
                  IF ch &lt;&gt; ')' THEN
                      error('")" expected        ');
                  getsym
                  END
              ELSE IF ch = '-' THEN
                  BEGIN
                  getsym;
                  factor(typ);
                  IF typ &lt;&gt; booltyp THEN
                      error(' boolean expected   ');
                  gen(notop,0,lastcode)
                  END
              ELSE IF (al = 'TRUE    ')
                    OR (al = 'FALSE   ') THEN
                  BEGIN
                  typ := booltyp;
                  gen(immed,ord(al = 'TRUE    '),0);
                  getsym
                  END
              ELSE IF al = 'ORD     ' THEN
                  BEGIN
                  getsym;
                  factor(typ);
                  typ := inttyp
                  END
              ELSE error('illegal IN factor   ')
              END; (* factor *)

            BEGIN (* term *)
            factor(typ);
            WHILE ch IN ['*','/','&amp;'] DO
                BEGIN
                IF (typ = booltyp) AND (ch IN ['*','/'])
                      OR (typ = inttyp) AND (ch = '&amp;')
                    THEN error('operand conflict    ');
                c := ch; left := lastcode;
                getsym;
                factor(typ2);
                IF typ &lt;&gt; typ2 THEN
                    error(' different types    ');
                CASE c OF
                    '*' : gen(mul,left,lastcode);
                    '/' : gen(divid,left,lastcode);
                    '&amp;' : gen(andop,left,lastcode)
                    END (* CASE *)
                END (* WHILE *)
            END; (* term *)

          BEGIN (* simpexpression *)
          term(typ);
          WHILE ch IN ['+','-','#'] DO
              BEGIN
              IF (typ = booltyp) AND (ch IN ['+','-'])
                    OR (typ = inttyp) AND (ch = '#')
                  THEN error('operand conflict    ');
              c := ch; left := lastcode;
              getsym;
              term(typ2);
              IF typ &lt;&gt; typ2 THEN
                error(' different types    ');
              CASE c OF
                  '+' : gen(add,left,lastcode);
                  '-' : gen(sub,left,lastcode);
                  '#' : gen(orop,left,lastcode)
                  END (* CASE *)
              END (* while *)
          END; (* simpexpression *)

        BEGIN (* expression *)
        simpexpression(typ);
        IF ch IN ['&gt;','&lt;','='] THEN
            BEGIN
            c := ch; left := lastcode;
            getsym;
            simpexpression(typ2);
            IF typ &lt;&gt; typ2 THEN
                error(' different types    ');
            typ := booltyp;
            CASE c OF
                '&gt;' : gen(great,left,lastcode);
                '&lt;' : gen(less,left,lastcode);
                '=' : gen(equal,left,lastcode)
                END (* CASE *)
            END (* IF *)
        END; (* expression *)

      BEGIN (* statement *)
      IF ch IN ['a'..'z'] THEN
            BEGIN (* assignment statement *)
            IF NOT (ch IN boolvars + intvars) THEN
                error('undeclared variable ');
            c := ch; left := ord(ch) - ord('a'); getsym;
            IF ch &lt;&gt; '=' THEN error('"=" expected        ');
            getsym; expression(typ);
            IF (c IN boolvars) AND (typ = inttyp)
                    OR (c IN intvars) AND (typ = booltyp)
                THEN error(' assignment conflict');
            IF typ = booltyp
                THEN gen(bassign,left,lastcode)
                ELSE gen(iassign,left,lastcode)
            END
      ELSE IF ch IN ['A'..'Z'] THEN
            BEGIN (* procedure call *)
            IF NOT (ch IN procedures) THEN
                error('undeclared procedure');
            gen(call,procaddresses[ch],0); getsym
            END
      ELSE IF al = 'BEGIN   ' THEN
            BEGIN
            getsym; statementsequence;
            IF al &lt;&gt; 'END     ' THEN error('"END" expected      ');
            getsym
            END
      ELSE IF al = 'IF      ' THEN
            BEGIN
            getsym; expression(typ);
            IF typ &lt;&gt; booltyp THEN
                error('must be boolean expr');
            left := lastcode;
            IF al &lt;&gt; 'THEN    ' THEN
                error('"THEN" expected     ');
            getsym; statement; gen(ifop,left,lastcode)
            END
      ELSE IF al = 'WHILE   ' THEN
            BEGIN
            getsym; expression(typ);
            IF typ &lt;&gt; booltyp THEN
                error('must be boolean expr');
            left := lastcode;
            IF al &lt;&gt; 'DO      ' THEN
                error('"DO" expected       ');
            getsym; statement; gen(whilop,left,lastcode)
            END
      ELSE IF al = 'READ    ' THEN
            BEGIN
            getsym;
            IF NOT (ch IN ['a'..'z'])
                THEN error('"a..z" expected     ');
            IF NOT (ch IN boolvars + intvars)
                THEN error('undeclared variable ');
            IF ch IN boolvars
                THEN gen(bread,ord(ch) - ord('a'),0)
                ELSE gen(iread,ord(ch) - ord('a'),0);
            getsym
            END
      ELSE IF al = 'WRITE   ' THEN
            BEGIN
            getsym; expression(typ);
            IF typ = booltyp
                THEN gen(bwrite,0,lastcode)
                ELSE gen(iwrite,0,lastcode)
            END
      ELSE IF al = 'LINE    ' THEN
            BEGIN getsym; gen(lineop,0,0) END
      ELSE IF al = 'TAB     ' THEN
            BEGIN getsym; gen(tabop,0,0) END
      ELSE error('illegal in statement')
      END; (* statement *)

    BEGIN (* statementsequence *)
    statement;
    WHILE ch = ';' DO
        BEGIN
        left := lastcode;
        getsym;
        statement;
        gen(semicol,left,lastcode)
        END
    END; (* statementsequence *)

  BEGIN (* body *)
  IF al &lt;&gt; 'BEGIN   ' THEN
      error('"BEGIN" expected    ');
  getsym;
  firstcode := lastcode + 1;
  statementsequence;
  IF tracing THEN
      BEGIN
      writeln; writeln(' ':tt,'code for this body :');
      FOR i := firstcode TO lastcode DO showcode(i)
      END;
  IF al &lt;&gt; 'END     ' THEN
      error('"END" expected      ');
  getsym
  END; (* body *)

BEGIN (* programme *)
boolvars := []; intvars := []; procedures := [];
lastcode := 0;
IF al = 'BOOLEAN ' THEN
    BEGIN
    getsym;
    WHILE ch IN ['a'..'z'] DO
        BEGIN
        IF ch IN boolvars THEN
            error('existing variable   ');
        boolvars := boolvars + [ch]; getsym
        END
    END; (* IF *)
IF al = 'INTEGER ' THEN
    BEGIN
    getsym;
    WHILE ch IN ['a'..'z'] DO
        BEGIN
        IF ch IN boolvars + intvars THEN
            error('existing variable   ');
        intvars := intvars + [ch]; getsym
        END (* WHILE *)
    END; (* IF *)
WHILE ch IN ['A'..'Z'] DO
    BEGIN
    IF ch IN procedures THEN
        error('existing procedure  ');
    procedures := procedures + [ch]; c := ch; getsym;
    body; procaddresses[c] := lastcode
    END; (* WHILE *)
body;
IF NOT (ch IN ['.','?']) THEN
    BEGIN writeln('"." assumed'); ch := '.' END;
tracing := ch = '?';
ch := ' '
END; (* programme *)

(* - - - - -   I N T E R P R E T E R   - - - - - *)

PROCEDURE interpret;
VAR  mem : ARRAY [0..25] OF integer;

  FUNCTION ival(n : integer) : integer;
  BEGIN (* ival *)
  WITH code[n] DO
      BEGIN
      IF tracing THEN showcode(n);
      CASE op OF
          fetch : ival := mem[left];
          immed : ival := left;
          add   : ival := ival(left)  +  ival(right);
          sub   : ival := ival(left)  -  ival(right);
          mul   : ival := ival(left)  *  ival(right);
          divid : ival := ival(left) DIV ival(right);
          END (* CASE *)
      END (* WITH *)
  END; (* ival *)

  FUNCTION bval(n : integer) : boolean;
  BEGIN (* bval *)
  WITH code[n] DO
      BEGIN
      IF tracing THEN showcode(n);
      CASE op OF
          fetch : bval := mem[left] = 1;
          immed : bval := left = 1;
          notop : bval :=            NOT bval(right);
          andop : bval := bval(left) AND bval(right);
          orop  : bval := bval(left) OR  bval(right);
          less  : bval := ival(left)  &lt;  ival(right);
          great : bval := ival(left)  &gt;  ival(right);
          equal : bval := ival(left)  =  ival(right)
          END (* CASE *)
      END (* WITH *)
  END; (* bval *)

  PROCEDURE exe(n : integer);
  VAR b : boolean; (* for reading *)
  BEGIN (* exe *)
  WITH code[n] DO
      BEGIN
      IF tracing THEN showcode(n);
      CASE op OF
          bassign : mem[left] := ord(bval(right));
          iassign : mem[left] := ival(right);
          call    : exe(left);
          semicol : BEGIN exe(left); exe(right) END;
          ifop    : IF bval(left) THEN exe(right);
          whilop  : WHILE bval(left) DO exe(right);
          bread   : BEGIN read(b); mem[left] := ord(b) END;
          iread   :       read(mem[left]);
          bwrite  : IF tracing THEN writeln(bval(right))
                               ELSE write  (bval(right));
          iwrite  : IF tracing THEN writeln(ival(right))
                               ELSE write  (ival(right));
          lineop  : writeln;
          tabop   : IF tracing THEN writeln
                               ELSE write(' ':10)
          END (* CASE *)
      END (* WITH *)
  END; (* exe *)

BEGIN (* interpret *)
IF echo THEN writeln;
IF tracing THEN writeln(' ':tt,'interpreting ...');
exe(lastcode);
IF tracing AND (boolvars + intvars &lt;&gt; []) THEN
    BEGIN
    writeln('variable':10,'value':10);
    FOR ch := 'a' TO 'z' DO
        IF ch IN boolvars + intvars THEN
            writeln(ch:10,mem[ord(ch)-ord('a')]:10)
    END
END; (* interpret *)

(* - - - - -   M A I N   - - - - - *)

BEGIN (* main *)
1:
REPEAT
    writeln('ready');
    getsym;
    IF ch &lt;&gt; '.' THEN
        BEGIN
        tracing := ch = '?'; IF tracing THEN getsym;
        programme; interpret
        END
    UNTIL ch = '.';
99:
END. (* main *)
</pre>


</div>

</div>
