text/07-an-imperative-language.org
* Exercises and reading

The exercises below are divided into two groups:
those that leave the language as it is and merely
change the implementation,
and those that change the language.

** /Changing the implementation/:
Improve the error reporting so that when an error has occurred, a marker is placed under the currently visible symbol and the error message is written next.  You will need to use an input line buffer, so that the whole line is written out when an error has been seen.  This affects procedure =getch= --- it now has to maintain this buffer, extract characters from it sequentially, and read a whole new line when the buffer is empty.

Rewrite the scanner so that it recognises reserved words like =BEGIN= and =IF= rather than leaving the recognition to the parser.  This will mean that procedure =getsym= reports to the parsing procedures that it has recognised a begin-symbol, or an if-symbol, and so on.  You will need to define an enumeration type for these symbols.  This enumeration type should include symbols for the single characters, too.  As a consequence, the parsing procedures do not have to know anything about the surface syntax of the language.

Study the notion of error recovery, and implement it in this compiler.  See Wirth (1976, p 320 - 322) for a description of error recovery.

Instead of implementing the binary tree code in =ARRAY=, use pointers.  Do not forget to dispose of unwanted pointers when a =programme= has been executed.

In the interpreter, add a check which prevents attempted division by zero.

Rewrite the interpreter without using recursion.

Redesign the internal code so that it is closer to a conventional machine language.  The simplest kind is code for a stack machine for evaluating expressions and for holding return addresses for procedures that have been called.  You will have to write a completely new interpreter.

Rewrite the program in a different language such as C or Lisp or Basic.

** /Changing the language/:
Just 26 lowercase variables and 26 uppercase procedures do not make programs very readable.  Change this so that variables and procedures can be any (perhaps lowercase) identifier --- starting with a letter optionally followed by further letters, digits (and perhaps underscores).  You will need to implement a symbol table in which such identifiers are stored when they are being declared.

The third little program in the sample run uses procedures, but they are not recursive.  Write a little program in the language which uses recursion.  Without actually running it, but by inspecting the Pascal program in the previous section, determine whether your program would work correctly.  If yes, explain how; if no, fix it.

Add the type =CHAR= to the language.  Define a method which allows users to write character strings.  This is particularly useful for obtaing readable output.  Do not attempt to implement string variables of arbitrary length --- this is quite difficult.

Implement =ELSE=, =REPEAT=, =FOR= and =CASE= statements.  Note that the latter two are much harder than the first two.

Add declarations for =ARRAY=\s of integers or of Booleans or of characters.  The declaration should specify their size, do not attempt to implement dynamically varying sizes.

Add local variables to procedures.  Since procedures should allow recursion, the local variables will have to be allocated on a stack.

Allow procedures to be called before they have been defined, but ensure that they have been defined before the body of the main program.

Add a facility for defining (parameterless) functions.  In one way functions are like procedures in that they have an executable code body.  In another way functions are like variables in that they have a type.  The type is given in the declaration, and it has to be recorded in the symbol table for later checking.

Implement value parameters for procedures (and functions).  Such parameters are just like local variables except that they are being initialised at the time of call.  So they will have to live on the stack, too.

** /Reading/:
Allison (1986, pp 52 - 59) gives a denotational semantics for a small imperative language, and (pp 120 - 127) a Pascal interpreter for the language.  Note that the interpreter is a close, almost literal, translation of the semantics into Pascal.  The closeness of the translation is intentional, it is bought at the price of efficiency.  You might like to write a more efficient version, but do try to understand why Allison made his translation so close.

If you wish to pursue the topic of compilers, you may wish to skip to Chapter 14 to study a somewhat more complex but still quite small compiler for another, more useable language.  Alternatively, you may wish to pursue the reading given in that chapter.

