07-an-imperative-language.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exercises and reading</h2>
<div class="outline-text-2" id="text-5">


<p>
The exercises below are divided into two groups:
those that leave the language as it is and merely
change the implementation,
and those that change the language.
</p>

</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <i>Changing the implementation</i>:</h3>
<div class="outline-text-3" id="text-5-1">

<p>Improve the error reporting so that when an error has occurred, a marker is placed under the currently visible symbol and the error message is written next.  You will need to use an input line buffer, so that the whole line is written out when an error has been seen.  This affects procedure <code>getch</code> &mdash; it now has to maintain this buffer, extract characters from it sequentially, and read a whole new line when the buffer is empty.
</p>
<p>
Rewrite the scanner so that it recognises reserved words like <code>BEGIN</code> and <code>IF</code> rather than leaving the recognition to the parser.  This will mean that procedure <code>getsym</code> reports to the parsing procedures that it has recognised a begin-symbol, or an if-symbol, and so on.  You will need to define an enumeration type for these symbols.  This enumeration type should include symbols for the single characters, too.  As a consequence, the parsing procedures do not have to know anything about the surface syntax of the language.
</p>
<p>
Study the notion of error recovery, and implement it in this compiler.  See Wirth (1976, p 320 - 322) for a description of error recovery.
</p>
<p>
Instead of implementing the binary tree code in <code>ARRAY</code>, use pointers.  Do not forget to dispose of unwanted pointers when a <code>programme</code> has been executed.
</p>
<p>
In the interpreter, add a check which prevents attempted division by zero.
</p>
<p>
Rewrite the interpreter without using recursion.
</p>
<p>
Redesign the internal code so that it is closer to a conventional machine language.  The simplest kind is code for a stack machine for evaluating expressions and for holding return addresses for procedures that have been called.  You will have to write a completely new interpreter.
</p>
<p>
Rewrite the program in a different language such as C or Lisp or Basic.
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <i>Changing the language</i>:</h3>
<div class="outline-text-3" id="text-5-2">

<p>Just 26 lowercase variables and 26 uppercase procedures do not make programs very readable.  Change this so that variables and procedures can be any (perhaps lowercase) identifier &mdash; starting with a letter optionally followed by further letters, digits (and perhaps underscores).  You will need to implement a symbol table in which such identifiers are stored when they are being declared.
</p>
<p>
The third little program in the sample run uses procedures, but they are not recursive.  Write a little program in the language which uses recursion.  Without actually running it, but by inspecting the Pascal program in the previous section, determine whether your program would work correctly.  If yes, explain how; if no, fix it.
</p>
<p>
Add the type <code>CHAR</code> to the language.  Define a method which allows users to write character strings.  This is particularly useful for obtaing readable output.  Do not attempt to implement string variables of arbitrary length &mdash; this is quite difficult.
</p>
<p>
Implement <code>ELSE</code>, <code>REPEAT</code>, <code>FOR</code> and <code>CASE</code> statements.  Note that the latter two are much harder than the first two.
</p>
<p>
Add declarations for <code>ARRAY</code>\s of integers or of Booleans or of characters.  The declaration should specify their size, do not attempt to implement dynamically varying sizes.
</p>
<p>
Add local variables to procedures.  Since procedures should allow recursion, the local variables will have to be allocated on a stack.
</p>
<p>
Allow procedures to be called before they have been defined, but ensure that they have been defined before the body of the main program.
</p>
<p>
Add a facility for defining (parameterless) functions.  In one way functions are like procedures in that they have an executable code body.  In another way functions are like variables in that they have a type.  The type is given in the declaration, and it has to be recorded in the symbol table for later checking.
</p>
<p>
Implement value parameters for procedures (and functions).  Such parameters are just like local variables except that they are being initialised at the time of call.  So they will have to live on the stack, too.
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-3">

<p>Allison (1986, pp 52 - 59) gives a denotational semantics for a small imperative language, and (pp 120 - 127) a Pascal interpreter for the language.  Note that the interpreter is a close, almost literal, translation of the semantics into Pascal.  The closeness of the translation is intentional, it is bought at the price of efficiency.  You might like to write a more efficient version, but do try to understand why Allison made his translation so close.
</p>
<p>
If you wish to pursue the topic of compilers, you may wish to skip to Chapter 14 to study a somewhat more complex but still quite small compiler for another, more useable language.  Alternatively, you may wish to pursue the reading given in that chapter.
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:38:07 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
